Revit 2027 API
ParameterTypeId.ProjectBuildingName Property
 "Building Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProjectBuildingName { get; }
Public Shared ReadOnly Property ProjectBuildingName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProjectBuildingName {
	ForgeTypeId^ get ();
}
static member ProjectBuildingName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace